; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob9) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 waypoint11 waypoint12 waypoint13 waypoint14 waypoint15 waypoint16 waypoint17 waypoint18 waypoint19 waypoint20 waypoint21 waypoint22 waypoint23 waypoint24 - Waypoint
	camera0 camera1 camera2 camera3 - Camera
	objective0 objective1 objective2 objective3 objective4 - Objective
	)
(:init
	(visible waypoint0 waypoint10)
	(visible waypoint10 waypoint0)
	(visible waypoint0 waypoint12)
	(visible waypoint12 waypoint0)
	(visible waypoint0 waypoint22)
	(visible waypoint22 waypoint0)
	(visible waypoint0 waypoint23)
	(visible waypoint23 waypoint0)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint10)
	(visible waypoint10 waypoint1)
	(visible waypoint1 waypoint23)
	(visible waypoint23 waypoint1)
	(visible waypoint1 waypoint24)
	(visible waypoint24 waypoint1)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint4)
	(visible waypoint4 waypoint2)
	(visible waypoint2 waypoint8)
	(visible waypoint8 waypoint2)
	(visible waypoint2 waypoint13)
	(visible waypoint13 waypoint2)
	(visible waypoint2 waypoint15)
	(visible waypoint15 waypoint2)
	(visible waypoint2 waypoint16)
	(visible waypoint16 waypoint2)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint13)
	(visible waypoint13 waypoint3)
	(visible waypoint3 waypoint20)
	(visible waypoint20 waypoint3)
	(visible waypoint3 waypoint21)
	(visible waypoint21 waypoint3)
	(visible waypoint4 waypoint16)
	(visible waypoint16 waypoint4)
	(visible waypoint4 waypoint18)
	(visible waypoint18 waypoint4)
	(visible waypoint4 waypoint23)
	(visible waypoint23 waypoint4)
	(visible waypoint5 waypoint8)
	(visible waypoint8 waypoint5)
	(visible waypoint5 waypoint17)
	(visible waypoint17 waypoint5)
	(visible waypoint6 waypoint10)
	(visible waypoint10 waypoint6)
	(visible waypoint6 waypoint20)
	(visible waypoint20 waypoint6)
	(visible waypoint6 waypoint24)
	(visible waypoint24 waypoint6)
	(visible waypoint7 waypoint9)
	(visible waypoint9 waypoint7)
	(visible waypoint7 waypoint16)
	(visible waypoint16 waypoint7)
	(visible waypoint7 waypoint17)
	(visible waypoint17 waypoint7)
	(visible waypoint7 waypoint20)
	(visible waypoint20 waypoint7)
	(visible waypoint8 waypoint9)
	(visible waypoint9 waypoint8)
	(visible waypoint8 waypoint14)
	(visible waypoint14 waypoint8)
	(visible waypoint8 waypoint16)
	(visible waypoint16 waypoint8)
	(visible waypoint9 waypoint4)
	(visible waypoint4 waypoint9)
	(visible waypoint9 waypoint22)
	(visible waypoint22 waypoint9)
	(visible waypoint10 waypoint3)
	(visible waypoint3 waypoint10)
	(visible waypoint10 waypoint4)
	(visible waypoint4 waypoint10)
	(visible waypoint10 waypoint9)
	(visible waypoint9 waypoint10)
	(visible waypoint10 waypoint13)
	(visible waypoint13 waypoint10)
	(visible waypoint10 waypoint14)
	(visible waypoint14 waypoint10)
	(visible waypoint11 waypoint4)
	(visible waypoint4 waypoint11)
	(visible waypoint11 waypoint6)
	(visible waypoint6 waypoint11)
	(visible waypoint11 waypoint8)
	(visible waypoint8 waypoint11)
	(visible waypoint11 waypoint15)
	(visible waypoint15 waypoint11)
	(visible waypoint11 waypoint17)
	(visible waypoint17 waypoint11)
	(visible waypoint11 waypoint19)
	(visible waypoint19 waypoint11)
	(visible waypoint12 waypoint3)
	(visible waypoint3 waypoint12)
	(visible waypoint12 waypoint7)
	(visible waypoint7 waypoint12)
	(visible waypoint12 waypoint9)
	(visible waypoint9 waypoint12)
	(visible waypoint12 waypoint14)
	(visible waypoint14 waypoint12)
	(visible waypoint12 waypoint17)
	(visible waypoint17 waypoint12)
	(visible waypoint12 waypoint21)
	(visible waypoint21 waypoint12)
	(visible waypoint13 waypoint0)
	(visible waypoint0 waypoint13)
	(visible waypoint13 waypoint1)
	(visible waypoint1 waypoint13)
	(visible waypoint13 waypoint5)
	(visible waypoint5 waypoint13)
	(visible waypoint13 waypoint11)
	(visible waypoint11 waypoint13)
	(visible waypoint13 waypoint17)
	(visible waypoint17 waypoint13)
	(visible waypoint14 waypoint21)
	(visible waypoint21 waypoint14)
	(visible waypoint15 waypoint0)
	(visible waypoint0 waypoint15)
	(visible waypoint15 waypoint6)
	(visible waypoint6 waypoint15)
	(visible waypoint15 waypoint7)
	(visible waypoint7 waypoint15)
	(visible waypoint15 waypoint20)
	(visible waypoint20 waypoint15)
	(visible waypoint15 waypoint24)
	(visible waypoint24 waypoint15)
	(visible waypoint16 waypoint0)
	(visible waypoint0 waypoint16)
	(visible waypoint16 waypoint1)
	(visible waypoint1 waypoint16)
	(visible waypoint16 waypoint17)
	(visible waypoint17 waypoint16)
	(visible waypoint16 waypoint24)
	(visible waypoint24 waypoint16)
	(visible waypoint17 waypoint0)
	(visible waypoint0 waypoint17)
	(visible waypoint17 waypoint8)
	(visible waypoint8 waypoint17)
	(visible waypoint17 waypoint15)
	(visible waypoint15 waypoint17)
	(visible waypoint17 waypoint22)
	(visible waypoint22 waypoint17)
	(visible waypoint18 waypoint5)
	(visible waypoint5 waypoint18)
	(visible waypoint18 waypoint6)
	(visible waypoint6 waypoint18)
	(visible waypoint18 waypoint7)
	(visible waypoint7 waypoint18)
	(visible waypoint18 waypoint15)
	(visible waypoint15 waypoint18)
	(visible waypoint19 waypoint12)
	(visible waypoint12 waypoint19)
	(visible waypoint19 waypoint13)
	(visible waypoint13 waypoint19)
	(visible waypoint20 waypoint5)
	(visible waypoint5 waypoint20)
	(visible waypoint20 waypoint14)
	(visible waypoint14 waypoint20)
	(visible waypoint20 waypoint18)
	(visible waypoint18 waypoint20)
	(visible waypoint21 waypoint4)
	(visible waypoint4 waypoint21)
	(visible waypoint21 waypoint7)
	(visible waypoint7 waypoint21)
	(visible waypoint21 waypoint13)
	(visible waypoint13 waypoint21)
	(visible waypoint21 waypoint17)
	(visible waypoint17 waypoint21)
	(visible waypoint21 waypoint20)
	(visible waypoint20 waypoint21)
	(visible waypoint22 waypoint2)
	(visible waypoint2 waypoint22)
	(visible waypoint22 waypoint3)
	(visible waypoint3 waypoint22)
	(visible waypoint22 waypoint11)
	(visible waypoint11 waypoint22)
	(visible waypoint23 waypoint3)
	(visible waypoint3 waypoint23)
	(visible waypoint23 waypoint12)
	(visible waypoint12 waypoint23)
	(visible waypoint23 waypoint13)
	(visible waypoint13 waypoint23)
	(visible waypoint23 waypoint14)
	(visible waypoint14 waypoint23)
	(visible waypoint23 waypoint16)
	(visible waypoint16 waypoint23)
	(visible waypoint23 waypoint17)
	(visible waypoint17 waypoint23)
	(visible waypoint24 waypoint5)
	(visible waypoint5 waypoint24)
	(visible waypoint24 waypoint17)
	(visible waypoint17 waypoint24)
	(visible waypoint24 waypoint20)
	(visible waypoint20 waypoint24)
	(at_rock_sample waypoint0)
	(at_soil_sample waypoint1)
	(at_rock_sample waypoint1)
	(at_rock_sample waypoint4)
	(at_rock_sample waypoint8)
	(at_soil_sample waypoint11)
	(at_rock_sample waypoint12)
	(at_soil_sample waypoint13)
	(at_rock_sample waypoint14)
	(at_rock_sample waypoint15)
	(at_soil_sample waypoint18)
	(at_rock_sample waypoint19)
	(at_soil_sample waypoint21)
	(at_rock_sample waypoint21)
	(at_rock_sample waypoint22)
	(at_soil_sample waypoint23)
	(at_lander general waypoint24)
	(channel_free general)
	(at rover0 waypoint21)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_imaging rover0)
	(can_traverse rover0 waypoint21 waypoint3)
	(can_traverse rover0 waypoint3 waypoint21)
	(can_traverse rover0 waypoint21 waypoint4)
	(can_traverse rover0 waypoint4 waypoint21)
	(can_traverse rover0 waypoint21 waypoint7)
	(can_traverse rover0 waypoint7 waypoint21)
	(can_traverse rover0 waypoint21 waypoint12)
	(can_traverse rover0 waypoint12 waypoint21)
	(can_traverse rover0 waypoint21 waypoint13)
	(can_traverse rover0 waypoint13 waypoint21)
	(can_traverse rover0 waypoint21 waypoint17)
	(can_traverse rover0 waypoint17 waypoint21)
	(can_traverse rover0 waypoint3 waypoint10)
	(can_traverse rover0 waypoint10 waypoint3)
	(can_traverse rover0 waypoint3 waypoint22)
	(can_traverse rover0 waypoint22 waypoint3)
	(can_traverse rover0 waypoint3 waypoint23)
	(can_traverse rover0 waypoint23 waypoint3)
	(can_traverse rover0 waypoint4 waypoint2)
	(can_traverse rover0 waypoint2 waypoint4)
	(can_traverse rover0 waypoint4 waypoint9)
	(can_traverse rover0 waypoint9 waypoint4)
	(can_traverse rover0 waypoint4 waypoint11)
	(can_traverse rover0 waypoint11 waypoint4)
	(can_traverse rover0 waypoint4 waypoint16)
	(can_traverse rover0 waypoint16 waypoint4)
	(can_traverse rover0 waypoint4 waypoint18)
	(can_traverse rover0 waypoint18 waypoint4)
	(can_traverse rover0 waypoint7 waypoint20)
	(can_traverse rover0 waypoint20 waypoint7)
	(can_traverse rover0 waypoint12 waypoint0)
	(can_traverse rover0 waypoint0 waypoint12)
	(can_traverse rover0 waypoint12 waypoint14)
	(can_traverse rover0 waypoint14 waypoint12)
	(can_traverse rover0 waypoint12 waypoint19)
	(can_traverse rover0 waypoint19 waypoint12)
	(can_traverse rover0 waypoint13 waypoint1)
	(can_traverse rover0 waypoint1 waypoint13)
	(can_traverse rover0 waypoint13 waypoint5)
	(can_traverse rover0 waypoint5 waypoint13)
	(can_traverse rover0 waypoint17 waypoint8)
	(can_traverse rover0 waypoint8 waypoint17)
	(can_traverse rover0 waypoint17 waypoint15)
	(can_traverse rover0 waypoint15 waypoint17)
	(can_traverse rover0 waypoint17 waypoint24)
	(can_traverse rover0 waypoint24 waypoint17)
	(can_traverse rover0 waypoint10 waypoint6)
	(can_traverse rover0 waypoint6 waypoint10)
	(at rover1 waypoint6)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint6 waypoint10)
	(can_traverse rover1 waypoint10 waypoint6)
	(can_traverse rover1 waypoint6 waypoint15)
	(can_traverse rover1 waypoint15 waypoint6)
	(can_traverse rover1 waypoint6 waypoint18)
	(can_traverse rover1 waypoint18 waypoint6)
	(can_traverse rover1 waypoint6 waypoint24)
	(can_traverse rover1 waypoint24 waypoint6)
	(can_traverse rover1 waypoint10 waypoint1)
	(can_traverse rover1 waypoint1 waypoint10)
	(can_traverse rover1 waypoint10 waypoint4)
	(can_traverse rover1 waypoint4 waypoint10)
	(can_traverse rover1 waypoint10 waypoint9)
	(can_traverse rover1 waypoint9 waypoint10)
	(can_traverse rover1 waypoint10 waypoint13)
	(can_traverse rover1 waypoint13 waypoint10)
	(can_traverse rover1 waypoint10 waypoint14)
	(can_traverse rover1 waypoint14 waypoint10)
	(can_traverse rover1 waypoint15 waypoint2)
	(can_traverse rover1 waypoint2 waypoint15)
	(can_traverse rover1 waypoint15 waypoint7)
	(can_traverse rover1 waypoint7 waypoint15)
	(can_traverse rover1 waypoint15 waypoint17)
	(can_traverse rover1 waypoint17 waypoint15)
	(can_traverse rover1 waypoint15 waypoint20)
	(can_traverse rover1 waypoint20 waypoint15)
	(can_traverse rover1 waypoint18 waypoint5)
	(can_traverse rover1 waypoint5 waypoint18)
	(can_traverse rover1 waypoint24 waypoint16)
	(can_traverse rover1 waypoint16 waypoint24)
	(can_traverse rover1 waypoint1 waypoint23)
	(can_traverse rover1 waypoint23 waypoint1)
	(can_traverse rover1 waypoint4 waypoint11)
	(can_traverse rover1 waypoint11 waypoint4)
	(can_traverse rover1 waypoint4 waypoint21)
	(can_traverse rover1 waypoint21 waypoint4)
	(can_traverse rover1 waypoint9 waypoint8)
	(can_traverse rover1 waypoint8 waypoint9)
	(can_traverse rover1 waypoint9 waypoint22)
	(can_traverse rover1 waypoint22 waypoint9)
	(can_traverse rover1 waypoint13 waypoint0)
	(can_traverse rover1 waypoint0 waypoint13)
	(on_board camera0 rover0)
	(calibration_target camera0 objective4)
	(supports camera0 colour)
	(on_board camera1 rover1)
	(calibration_target camera1 objective3)
	(supports camera1 high_res)
	(on_board camera2 rover0)
	(calibration_target camera2 objective3)
	(supports camera2 colour)
	(on_board camera3 rover1)
	(calibration_target camera3 objective2)
	(supports camera3 colour)
	(supports camera3 high_res)
	(visible_from objective0 waypoint24)
	(visible_from objective1 waypoint0)
	(visible_from objective1 waypoint3)
	(visible_from objective1 waypoint4)
	(visible_from objective1 waypoint6)
	(visible_from objective1 waypoint8)
	(visible_from objective1 waypoint15)
	(visible_from objective1 waypoint19)
	(visible_from objective1 waypoint20)
	(visible_from objective1 waypoint22)
	(visible_from objective1 waypoint23)
	(visible_from objective2 waypoint2)
	(visible_from objective2 waypoint4)
	(visible_from objective2 waypoint7)
	(visible_from objective2 waypoint9)
	(visible_from objective2 waypoint10)
	(visible_from objective2 waypoint14)
	(visible_from objective2 waypoint15)
	(visible_from objective2 waypoint16)
	(visible_from objective2 waypoint17)
	(visible_from objective2 waypoint18)
	(visible_from objective2 waypoint21)
	(visible_from objective2 waypoint22)
	(visible_from objective2 waypoint24)
	(visible_from objective3 waypoint2)
	(visible_from objective3 waypoint7)
	(visible_from objective3 waypoint8)
	(visible_from objective3 waypoint10)
	(visible_from objective3 waypoint13)
	(visible_from objective3 waypoint18)
	(visible_from objective3 waypoint23)
	(visible_from objective3 waypoint24)
	(visible_from objective4 waypoint0)
	(visible_from objective4 waypoint4)
	(visible_from objective4 waypoint9)
	(visible_from objective4 waypoint17)
	(visible_from objective4 waypoint19)
	(visible_from objective4 waypoint21)
)

(:goal (and
(communicated_soil_data waypoint21)
(communicated_soil_data waypoint13)
(communicated_soil_data waypoint1)
(communicated_soil_data waypoint11)
(communicated_soil_data waypoint18)
(communicated_soil_data waypoint23)
(communicated_image_data objective2 colour)
(communicated_image_data objective1 colour)
(communicated_image_data objective4 colour)
(communicated_image_data objective3 colour)
(communicated_image_data objective1 high_res)
	)
)
)

; plan
1. (navigate rover1 waypoint6 waypoint15)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint15)
   goals met: 0 of 11
2. (calibrate rover1 camera3 objective2 waypoint15)
   added: (calibrated camera3 rover1)
   goals met: 0 of 11
3. (navigate rover1 waypoint15 waypoint7)
   deleted: (at rover1 waypoint15)
   added: (at rover1 waypoint7)
   goals met: 0 of 11
4. (calibrate rover0 camera0 objective4 waypoint21)
   added: (calibrated camera0 rover0)
   goals met: 0 of 11
5. (take_image rover0 waypoint21 objective4 camera0 colour)
   deleted: (calibrated camera0 rover0)
   added: (have_image rover0 objective4 colour)
   goals met: 0 of 11
6. (navigate rover0 waypoint21 waypoint13)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint13)
   goals met: 0 of 11
7. (navigate rover0 waypoint13 waypoint1)
   deleted: (at rover0 waypoint13)
   added: (at rover0 waypoint1)
   goals met: 0 of 11
8. (communicate_image_data rover0 general objective4 colour waypoint1 waypoint24)
   added: (communicated_image_data objective4 colour)
   goals met: 1 of 11
9. (take_image rover1 waypoint7 objective2 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 colour)
   goals met: 1 of 11
10. (calibrate rover1 camera3 objective2 waypoint7)
   added: (calibrated camera3 rover1)
   goals met: 1 of 11
11. (navigate rover1 waypoint7 waypoint15)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint15)
   goals met: 1 of 11
12. (communicate_image_data rover1 general objective2 colour waypoint15 waypoint24)
   added: (communicated_image_data objective2 colour)
   goals met: 2 of 11
13. (take_image rover1 waypoint15 objective1 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 2 of 11
14. (calibrate rover1 camera3 objective2 waypoint15)
   added: (calibrated camera3 rover1)
   goals met: 2 of 11
15. (communicate_image_data rover1 general objective1 colour waypoint15 waypoint24)
   added: (communicated_image_data objective1 colour)
   goals met: 3 of 11
16. (take_image rover1 waypoint15 objective1 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective1 high_res)
   goals met: 3 of 11
17. (calibrate rover1 camera3 objective2 waypoint15)
   added: (calibrated camera3 rover1)
   goals met: 3 of 11
18. (communicate_image_data rover1 general objective1 high_res waypoint15 waypoint24)
   added: (communicated_image_data objective1 high_res)
   goals met: 4 of 11
19. (navigate rover1 waypoint15 waypoint7)
   deleted: (at rover1 waypoint15)
   added: (at rover1 waypoint7)
   goals met: 4 of 11
20. (take_image rover1 waypoint7 objective3 camera3 colour)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective3 colour)
   goals met: 4 of 11
21. (navigate rover1 waypoint7 waypoint15)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint15)
   goals met: 4 of 11
22. (communicate_image_data rover1 general objective3 colour waypoint15 waypoint24)
   added: (communicated_image_data objective3 colour)
   goals met: 5 of 11
23. (sample_soil rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_soil_sample waypoint1)
   added: (have_soil_analysis rover0 waypoint1) (full rover0store)
   goals met: 5 of 11
24. (communicate_soil_data rover0 general waypoint1 waypoint1 waypoint24)
   added: (communicated_soil_data waypoint1)
   goals met: 6 of 11
25. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 6 of 11
26. (navigate rover0 waypoint1 waypoint13)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint13)
   goals met: 6 of 11
27. (navigate rover0 waypoint13 waypoint21)
   deleted: (at rover0 waypoint13)
   added: (at rover0 waypoint21)
   goals met: 6 of 11
28. (sample_soil rover0 rover0store waypoint21)
   deleted: (empty rover0store) (at_soil_sample waypoint21)
   added: (have_soil_analysis rover0 waypoint21) (full rover0store)
   goals met: 6 of 11
29. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 6 of 11
30. (navigate rover0 waypoint21 waypoint17)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint17)
   goals met: 6 of 11
31. (communicate_soil_data rover0 general waypoint21 waypoint17 waypoint24)
   added: (communicated_soil_data waypoint21)
   goals met: 7 of 11
32. (navigate rover0 waypoint17 waypoint21)
   deleted: (at rover0 waypoint17)
   added: (at rover0 waypoint21)
   goals met: 7 of 11
33. (navigate rover0 waypoint21 waypoint4)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint4)
   goals met: 7 of 11
34. (navigate rover0 waypoint4 waypoint11)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint11)
   goals met: 7 of 11
35. (sample_soil rover0 rover0store waypoint11)
   deleted: (empty rover0store) (at_soil_sample waypoint11)
   added: (have_soil_analysis rover0 waypoint11) (full rover0store)
   goals met: 7 of 11
36. (navigate rover0 waypoint11 waypoint4)
   deleted: (at rover0 waypoint11)
   added: (at rover0 waypoint4)
   goals met: 7 of 11
37. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 7 of 11
38. (navigate rover0 waypoint4 waypoint16)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint16)
   goals met: 7 of 11
39. (communicate_soil_data rover0 general waypoint11 waypoint16 waypoint24)
   added: (communicated_soil_data waypoint11)
   goals met: 8 of 11
40. (navigate rover0 waypoint16 waypoint4)
   deleted: (at rover0 waypoint16)
   added: (at rover0 waypoint4)
   goals met: 8 of 11
41. (navigate rover0 waypoint4 waypoint18)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint18)
   goals met: 8 of 11
42. (sample_soil rover0 rover0store waypoint18)
   deleted: (empty rover0store) (at_soil_sample waypoint18)
   added: (have_soil_analysis rover0 waypoint18) (full rover0store)
   goals met: 8 of 11
43. (navigate rover0 waypoint18 waypoint4)
   deleted: (at rover0 waypoint18)
   added: (at rover0 waypoint4)
   goals met: 8 of 11
44. (navigate rover0 waypoint4 waypoint21)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint21)
   goals met: 8 of 11
45. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 8 of 11
46. (navigate rover0 waypoint21 waypoint17)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint17)
   goals met: 8 of 11
47. (communicate_soil_data rover0 general waypoint18 waypoint17 waypoint24)
   added: (communicated_soil_data waypoint18)
   goals met: 9 of 11
48. (navigate rover0 waypoint17 waypoint21)
   deleted: (at rover0 waypoint17)
   added: (at rover0 waypoint21)
   goals met: 9 of 11
49. (navigate rover0 waypoint21 waypoint13)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint13)
   goals met: 9 of 11
50. (sample_soil rover0 rover0store waypoint13)
   deleted: (empty rover0store) (at_soil_sample waypoint13)
   added: (have_soil_analysis rover0 waypoint13) (full rover0store)
   goals met: 9 of 11
51. (navigate rover0 waypoint13 waypoint1)
   deleted: (at rover0 waypoint13)
   added: (at rover0 waypoint1)
   goals met: 9 of 11
52. (communicate_soil_data rover0 general waypoint13 waypoint1 waypoint24)
   added: (communicated_soil_data waypoint13)
   goals met: 10 of 11
53. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 10 of 11
54. (navigate rover0 waypoint1 waypoint13)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint13)
   goals met: 10 of 11
55. (navigate rover0 waypoint13 waypoint21)
   deleted: (at rover0 waypoint13)
   added: (at rover0 waypoint21)
   goals met: 10 of 11
56. (navigate rover0 waypoint21 waypoint3)
   deleted: (at rover0 waypoint21)
   added: (at rover0 waypoint3)
   goals met: 10 of 11
57. (navigate rover0 waypoint3 waypoint23)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint23)
   goals met: 10 of 11
58. (sample_soil rover0 rover0store waypoint23)
   deleted: (empty rover0store) (at_soil_sample waypoint23)
   added: (have_soil_analysis rover0 waypoint23) (full rover0store)
   goals met: 10 of 11
59. (navigate rover0 waypoint23 waypoint3)
   deleted: (at rover0 waypoint23)
   added: (at rover0 waypoint3)
   goals met: 10 of 11
60. (navigate rover0 waypoint3 waypoint10)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint10)
   goals met: 10 of 11
61. (navigate rover0 waypoint10 waypoint6)
   deleted: (at rover0 waypoint10)
   added: (at rover0 waypoint6)
   goals met: 10 of 11
62. (communicate_soil_data rover0 general waypoint23 waypoint6 waypoint24)
   added: (communicated_soil_data waypoint23)
   goals met: 11 of 11
